{"loss": "categorical_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 64, "input_dtype": "float32", "border_mode": "same", "batch_input_shape": [null, 1, 48, 48], "W_regularizer": null, "activation": "linear", "nb_row": 3}}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_1"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_2"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_3"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_4"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_5"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_5", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_6"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_6", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 512}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_7", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_7"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 512}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_8", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_8"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 7}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "sample_weight_mode": null}